/*
Задание №1
Список заданий:
    - Если нет опыта работы с Git и удаленными репозиториями ознакомьтесь с ресурсами которые прикреплены в карточке "Ресурсы для изучения"
- Создать репозиторий в Github
- Ознакомиться с Markdown синтаксисом
- Изучить основы синтаксиса JavaScript
- Изучить как работает JavaScript (V8), историю развития языка, ознакомиться со стандартами ECMAScript, почему именно JavaScript сейчас очень популярен, его плюсы и минусы
- Изучить что такое асинхронное программирование, в чем отличие от синхронного программирования, что такое Event Loop
- Установить NodeJS
- Изучить что такое NodeJS, пакетный менеджер npm
- Изучить генератор документации кода JSDoc
- Изучить что такое кроссбраузерность, историю развития популярных современных браузеров (Google Chrome, Mozilla, Opera, IE😁, Safari, Edge)

Для тех у кого нету базы по верстке (HTML, CSS):

HTML
- Структура HTML, базовые тэги
- HTML5, семантическая верстка
- Работа с формами

CSS
- Селекторы (классы, тэги)
- Box model
- Позиционирование (absolute, relative, sticky, fixed)
- Flexbox (+Grid)
- Псевдоэлементы (hover, after, before, first-child, last-child, nth-child etc)
- Префиксы (сайт caniuse)
- Медиа запросы (media query) - адаптивная и отзывчивая верстка (adaptive & responsive)
- Анимации (transition, keyframes)*/
